-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: localhost:8889
-- Generation Time: Nov 30, 2023 at 06:21 PM
-- Server version: 5.7.39
-- PHP Version: 8.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `Cyborgs`
--

-- --------------------------------------------------------

--
-- Table structure for table `bullets`
--

CREATE TABLE `bullets` (
  `id` int(11) NOT NULL,
  `bullet_id` varchar(255) NOT NULL,
  `x` varchar(255) NOT NULL,
  `y` varchar(255) NOT NULL,
  `vx` varchar(255) NOT NULL,
  `vy` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `bullets`
--

INSERT INTO `bullets` (`id`, `bullet_id`, `x`, `y`, `vx`, `vy`) VALUES
(2, '1', '2', '1', '9', '10'),
(3, '2', '1', '1', '1', '1');

-- --------------------------------------------------------

--
-- Table structure for table `game`
--

CREATE TABLE `game` (
  `id` int(11) NOT NULL,
  `version` varchar(256) NOT NULL,
  `chat_hash` varchar(256) NOT NULL,
  `scene_hash` varchar(255) NOT NULL,
  `teams_hash` varchar(255) NOT NULL,
  `bullets_hash` varchar(255) NOT NULL,
  `objects_hash` varchar(255) NOT NULL,
  `players_hash` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `game`
--

INSERT INTO `game` (`id`, `version`, `chat_hash`, `scene_hash`, `teams_hash`, `bullets_hash`, `objects_hash`, `players_hash`) VALUES
(1, '0.1', 'ccdf72e4a201ef941828e6dbf9681638', '0c7a1092132af67d0a9f230d92d1895c', '122', '311', '32', '3221');

-- --------------------------------------------------------

--
-- Table structure for table `messages`
--

CREATE TABLE `messages` (
  `id` int(11) NOT NULL,
  `user_id` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `message` longtext CHARACTER SET utf8,
  `created` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf16 COLLATE=utf16_bin;

--
-- Dumping data for table `messages`
--

INSERT INTO `messages` (`id`, `user_id`, `message`, `created`) VALUES
(277, '39', 'лол', '2023-11-22 13:06:25'),
(278, '39', 'как дела', '2023-11-22 13:06:29'),
(279, '45', 'нормас', '2023-11-22 13:07:03'),
(280, '45', 'о', '2023-11-22 13:07:05'),
(281, '45', 'работает', '2023-11-22 13:07:10'),
(282, '45', 'хммммм', '2023-11-22 13:07:26'),
(283, '45', 'tgitogkg', '2023-11-22 13:08:12'),
(284, '45', 'Раз два три', '2023-11-22 13:08:38'),
(285, '45', 'regrggr', '2023-11-22 13:09:03'),
(286, '39', 'фыцуввцы', '2023-11-22 13:10:31'),
(287, '39', 'фыцуввцы', '2023-11-22 13:10:31'),
(288, '39', 'фыв', '2023-11-22 13:10:32'),
(289, '39', '123Тест', '2023-11-22 13:10:36'),
(290, '45', 'hhrdh', '2023-11-22 13:11:24'),
(291, '45', 'fkwfkkw;', '2023-11-22 13:11:41'),
(292, '45', 'fkwfkkw;', '2023-11-22 13:11:42'),
(293, '45', 'gergerg', '2023-11-22 13:12:09'),
(294, '45', 'gergerg', '2023-11-22 13:12:10'),
(295, '45', 'gergerg', '2023-11-22 13:12:12'),
(296, '45', 'интернет', '2023-11-22 13:13:41'),
(297, '45', 'ПЕРЕР', '2023-11-22 13:21:40'),
(298, '45', 'ПЕРЕР', '2023-11-22 13:21:41'),
(299, '45', 'РПОП', '2023-11-22 13:25:00'),
(300, '45', 'ГЕ77', '2023-11-22 13:26:28'),
(301, '45', 'ГЕ77', '2023-11-22 13:26:29'),
(302, '45', 'UII', '2023-11-22 13:26:36'),
(303, '45', 'EWEWE', '2023-11-22 13:54:41'),
(304, '17', 'UWU', '2023-11-22 15:25:15'),
(305, '39', 'Привет', '2023-11-22 15:31:49'),
(306, '6', 'TS говно', '2023-11-22 15:32:24'),
(307, '17', 'UWU', '2023-11-22 15:32:25'),
(308, '17', 'UWU', '2023-11-22 15:32:25'),
(309, '18', 'Что такое?', '2023-11-22 15:33:12'),
(310, '18', 'Что надо?', '2023-11-22 15:33:37'),
(311, '1', 'Тренируйся', '2023-11-22 15:34:23'),
(312, '6', '32', '2023-11-22 15:35:09'),
(313, '6', '343252', '2023-11-22 15:35:11'),
(314, '18', '123', '2023-11-22 15:37:26'),
(315, '18', 'лол', '2023-11-22 15:38:28'),
(316, '6', '3', '2023-11-22 15:39:54'),
(317, '17', 'Никита го напы', '2023-11-22 15:58:08'),
(318, '1', 'asdad', '2023-11-22 16:23:52'),
(319, '1', 'asd', '2023-11-22 16:23:57'),
(320, '1', 'asd12', '2023-11-22 16:24:19'),
(321, '1', 'asd', '2023-11-22 16:24:28'),
(322, '1', 'asd', '2023-11-22 16:24:37'),
(323, '5', 'ты говно', '2023-11-23 12:08:27'),
(324, '5', 'привет', '2023-11-23 12:08:56'),
(325, '6', '745', '2023-11-23 12:20:27'),
(326, '6', '3213', '2023-11-23 12:27:12'),
(327, '6', '756868', '2023-11-23 12:27:15'),
(328, '6', '23', '2023-11-23 14:00:35'),
(329, '6', '4', '2023-11-23 14:10:03'),
(330, '6', '53', '2023-11-23 14:39:07'),
(331, '6', '4342', '2023-11-23 14:49:55'),
(332, '6', '53454353454534543', '2023-11-23 14:54:57'),
(333, '6', '434', '2023-11-23 14:55:04'),
(334, '6', '656546', '2023-11-23 14:55:12'),
(335, '6', '54654654', '2023-11-23 14:55:14'),
(336, '6', '54645645', '2023-11-23 14:55:15'),
(337, '6', '5646546', '2023-11-23 14:55:17'),
(338, '6', '6456', '2023-11-23 14:55:23'),
(339, '6', '5464', '2023-11-23 14:55:42'),
(340, '6', '4324', '2023-11-23 14:56:13'),
(341, '6', '4324', '2023-11-23 14:56:14'),
(342, '6', '6546', '2023-11-23 14:56:16'),
(343, '6', '7657', '2023-11-23 14:56:17'),
(344, '6', '543', '2023-11-23 14:56:42'),
(345, '6', '4', '2023-11-23 15:14:16'),
(346, '6', '525', '2023-11-23 15:45:11'),
(347, '6', '1212', '2023-11-23 15:45:21'),
(348, '6', '2', '2023-11-23 15:45:24'),
(349, '6', '2', '2023-11-23 15:45:24'),
(350, '6', '3', '2023-11-23 15:45:25'),
(351, '6', '4', '2023-11-23 15:45:27'),
(352, '6', '5', '2023-11-23 15:45:28'),
(353, '6', '6', '2023-11-23 15:45:29'),
(354, '6', '7', '2023-11-23 15:45:30'),
(355, '6', '8', '2023-11-23 15:45:31'),
(356, '6', '9', '2023-11-23 15:45:32'),
(357, '46', '12132', '2023-11-23 15:45:34'),
(358, '6', '10', '2023-11-23 15:45:34'),
(359, '46', 'dfgdgf', '2023-11-23 15:45:38'),
(360, '46', 'dfgddgf', '2023-11-23 15:45:41'),
(361, '46', ';lmvbnmb;lmn;vlb', '2023-11-23 15:45:43'),
(362, '46', 'Bim', '2023-11-23 15:45:48'),
(363, '46', 'BIm', '2023-11-23 15:45:50'),
(364, '6', 'Дима, мы знаем что это ты', '2023-11-23 15:46:06'),
(365, '6', 'Забанили тебя, дурачек', '2023-11-23 15:46:49'),
(366, '1', 'мда ебать', '2023-11-23 15:47:57'),
(367, '1', 'опа', '2023-11-23 15:48:31'),
(368, '47', '(', '2023-11-23 15:54:31'),
(369, '47', '123', '2023-11-23 16:12:27'),
(370, '47', 'Тест1', '2023-11-23 16:30:02'),
(371, '47', 'Вроде работает', '2023-11-23 16:31:24'),
(372, '6', 'ю', '2023-11-23 17:53:18'),
(373, '1', '123', '2023-11-24 07:11:49'),
(374, '6', '12', '2023-11-24 08:51:36'),
(375, '6', '4324', '2023-11-24 08:52:36'),
(376, '6', '333213', '2023-11-24 08:53:07'),
(377, '6', '33', '2023-11-24 08:53:07'),
(378, '6', '333213', '2023-11-24 08:53:08'),
(379, '6', '33', '2023-11-24 08:53:08'),
(380, '6', '333213', '2023-11-24 08:53:08'),
(381, '6', '333213', '2023-11-24 08:53:08'),
(382, '6', '333213', '2023-11-24 08:53:08'),
(383, '6', '333213', '2023-11-24 08:53:08'),
(384, '6', '333213', '2023-11-24 08:53:08'),
(385, '6', '333213', '2023-11-24 08:53:08'),
(386, '6', '333213', '2023-11-24 08:53:08'),
(387, '6', '333213', '2023-11-24 08:53:09'),
(388, '6', '333213', '2023-11-24 08:53:09'),
(389, '6', '333213', '2023-11-24 08:53:09'),
(390, '6', '333213', '2023-11-24 08:53:09'),
(391, '6', '33', '2023-11-24 08:53:09'),
(392, '6', '333213', '2023-11-24 08:53:09'),
(393, '6', '33', '2023-11-24 08:53:09'),
(394, '6', '333213', '2023-11-24 08:53:09'),
(395, '6', '33', '2023-11-24 08:53:09'),
(396, '6', '33', '2023-11-24 08:53:09'),
(397, '6', '33', '2023-11-24 08:53:09'),
(398, '6', '33', '2023-11-24 08:53:09'),
(399, '6', '33', '2023-11-24 08:53:10'),
(400, '6', '33', '2023-11-24 08:53:10'),
(401, '6', '33', '2023-11-24 08:53:10'),
(402, '6', '33', '2023-11-24 08:53:10'),
(403, '6', '33', '2023-11-24 08:53:10'),
(404, '6', '33', '2023-11-24 08:53:10'),
(405, '6', '43', '2023-11-24 12:54:36'),
(406, '6', '8', '2023-11-24 12:54:39'),
(407, '6', 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa', '2023-11-24 12:54:45'),
(408, '6', 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa', '2023-11-24 12:54:45'),
(409, '6', 'aaaaaaaaaddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd', '2023-11-24 12:54:52'),
(410, '6', 'ssssssssssssssssssssssswwwwwwwddddddddddddddddddwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwsa', '2023-11-24 12:54:59'),
(411, '47', 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя', '2023-11-24 13:52:25'),
(412, '17', 'пися попа чилен', '2023-11-24 20:40:16'),
(413, '47', 'Бимбимбамбам', '2023-11-25 15:56:49'),
(414, '48', 'fddsfdsfdsfsfdsfsdefsf', '2023-11-25 17:45:08'),
(415, '48', 'fddsfdsfdsfsfdsfsdefsf', '2023-11-25 17:45:08'),
(416, '47', 'У тебя батя х***ос', '2023-11-25 18:51:41'),
(417, '47', 'Сынок', '2023-11-25 18:51:48'),
(418, '47', 'bzdvm', '2023-11-26 08:38:32'),
(419, '47', 'njng', '2023-11-26 08:59:38'),
(420, '47', 'gklnfnd', '2023-11-26 08:59:40'),
(421, '47', 'gkldfnlds', '2023-11-26 08:59:42'),
(422, '1', 'asd', '2023-11-26 10:51:52'),
(423, '5', 'fsdf', '2023-11-26 10:59:02'),
(424, '5', 'd', '2023-11-26 11:00:28'),
(425, '5', 'sad', '2023-11-26 11:00:30'),
(426, '5', 'fsdf', '2023-11-26 11:05:54'),
(427, '5', 'asdfaf', '2023-11-26 11:05:58'),
(428, '5', 'asdfafa', '2023-11-26 11:06:00'),
(429, '5', 'dasfasfd', '2023-11-26 11:06:02'),
(430, '5', 'sdaf', '2023-11-26 11:06:29'),
(431, '5', 'ewrqrre', '2023-11-26 11:07:07'),
(432, '5', 'ewrqrre', '2023-11-26 11:07:07'),
(433, '5', 'rwerwer', '2023-11-26 11:07:09'),
(434, '5', 'rewqrqrqw', '2023-11-26 11:07:13'),
(435, '5', 'dssaf', '2023-11-26 11:09:21'),
(436, '5', 'dsags', '2023-11-26 11:27:09'),
(437, '5', 'dasffasd', '2023-11-26 11:27:12'),
(438, '5', 'afadsf', '2023-11-26 11:31:18'),
(439, '5', 'asdfasdfasdfa', '2023-11-26 11:31:21'),
(440, '5', 'sdafafa', '2023-11-26 11:31:23'),
(441, '5', 'dsf', '2023-11-26 11:41:58'),
(442, '5', 'dfsa', '2023-11-26 11:43:07'),
(443, '5', 'fda', '2023-11-26 11:44:15'),
(444, '47', 'gb,dbg', '2023-11-26 11:44:17'),
(445, '47', 'wesaewaeaw', '2023-11-26 11:44:20'),
(446, '47', 'e', '2023-11-26 11:44:20'),
(447, '47', 'awe', '2023-11-26 11:44:21'),
(448, '47', 's', '2023-11-26 11:44:21'),
(449, '47', 'e', '2023-11-26 11:44:22'),
(450, '47', 'e', '2023-11-26 11:44:22'),
(451, '47', 'a', '2023-11-26 11:44:22'),
(452, '47', 'we', '2023-11-26 11:44:23'),
(453, '47', 'wa', '2023-11-26 11:44:23'),
(454, '47', 's', '2023-11-26 11:44:24'),
(455, '47', 'w', '2023-11-26 11:44:24'),
(456, '5', 'fad', '2023-11-26 11:44:24'),
(457, '47', 'e', '2023-11-26 11:44:24'),
(458, '47', 'aw', '2023-11-26 11:44:25'),
(459, '47', 'e', '2023-11-26 11:44:25'),
(460, '47', 'a', '2023-11-26 11:44:25'),
(461, '47', 'wa', '2023-11-26 11:44:26'),
(462, '47', 'wa', '2023-11-26 11:44:27'),
(463, '47', 'e', '2023-11-26 11:44:28'),
(464, '47', 'w', '2023-11-26 11:44:28'),
(465, '47', 's', '2023-11-26 11:44:29'),
(466, '47', 'e', '2023-11-26 11:44:29'),
(467, '47', 'se', '2023-11-26 11:44:30'),
(468, '47', 'eeee', '2023-11-26 11:44:31'),
(469, '47', 'a', '2023-11-26 11:44:31'),
(470, '47', 'se', '2023-11-26 11:44:32'),
(471, '47', 'wae', '2023-11-26 11:44:33'),
(472, '47', 'we', '2023-11-26 11:44:34'),
(473, '5', 'dsaf', '2023-11-26 11:44:37'),
(474, '5', 'asdf', '2023-11-26 11:44:50'),
(475, '5', 'fds', '2023-11-26 11:47:36'),
(476, '5', 'sdfs', '2023-11-26 11:47:38'),
(477, '5', 'dsaf', '2023-11-26 11:47:44'),
(478, '5', 'fdasf', '2023-11-26 11:48:00'),
(479, '5', 'fdsf', '2023-11-26 11:49:19'),
(480, '5', 'fadsf', '2023-11-26 11:49:25'),
(481, '5', 'fdsf', '2023-11-26 11:52:31'),
(482, '5', 'dsa', '2023-11-26 11:52:50'),
(483, '5', '3', '2023-11-26 11:53:33'),
(484, '5', 'sdaf', '2023-11-26 11:54:00'),
(485, '5', 'asdf', '2023-11-26 11:54:01'),
(486, '5', 'asdg', '2023-11-26 11:54:03'),
(487, '5', 'asdg', '2023-11-26 11:54:08'),
(488, '5', 'asdg', '2023-11-26 11:54:09'),
(489, '5', 'fdsa', '2023-11-26 11:55:53'),
(490, '5', 'fdsa', '2023-11-26 11:56:24'),
(491, '5', 'sad', '2023-11-26 11:56:54'),
(492, '5', 'asdasd', '2023-11-26 11:56:56'),
(493, '5', 'fdsf', '2023-11-26 11:57:48'),
(494, '5', 'saff', '2023-11-26 11:58:47'),
(495, '5', 'saff', '2023-11-26 11:58:47'),
(496, '5', 'sadf', '2023-11-26 11:58:49'),
(497, '5', 'fasdf', '2023-11-26 11:58:56'),
(498, '5', 'dsaf', '2023-11-26 11:58:58'),
(499, '5', 'sadfaf', '2023-11-26 11:59:01'),
(500, '5', 'sadf', '2023-11-26 11:59:03'),
(501, '5', 'fsda', '2023-11-26 11:59:14'),
(502, '5', 'dsaf', '2023-11-26 11:59:17'),
(503, '5', 'sadf', '2023-11-26 11:59:19'),
(504, '5', 'dsafas', '2023-11-26 11:59:21'),
(505, '5', 'fsdafsa', '2023-11-26 11:59:22'),
(506, '5', 'sdafsa', '2023-11-26 11:59:24'),
(507, '5', 'fsadfas', '2023-11-26 11:59:25'),
(508, '5', 'sdafas', '2023-11-26 11:59:31'),
(509, '5', 'dsaf', '2023-11-26 11:59:56'),
(510, '5', 'dsaf', '2023-11-26 11:59:58'),
(511, '5', 'asdfaf', '2023-11-26 11:59:59'),
(512, '5', 'dasfaf', '2023-11-26 12:00:01'),
(513, '5', 'fdsaf', '2023-11-26 12:00:55'),
(514, '5', 'fsdaf', '2023-11-26 12:00:57'),
(515, '5', 'sdafaf', '2023-11-26 12:00:58'),
(516, '5', 'afdas', '2023-11-26 12:01:00'),
(517, '5', 'dsafdsaf', '2023-11-26 12:01:19'),
(518, '5', 'dsaf', '2023-11-26 12:01:19'),
(519, '5', 'dsaf', '2023-11-26 12:01:20'),
(520, '5', 'dsafdsaf', '2023-11-26 12:01:20'),
(521, '5', 'dsaf', '2023-11-26 12:01:21'),
(522, '5', 'dsafdsaf', '2023-11-26 12:01:21'),
(523, '5', 'dsaf', '2023-11-26 12:01:21'),
(524, '5', 'dsafdsaf', '2023-11-26 12:01:21'),
(525, '5', 'dsaf', '2023-11-26 12:01:21'),
(526, '5', 'dsafdsaf', '2023-11-26 12:01:21'),
(527, '5', 'dsafdsaf', '2023-11-26 12:01:21'),
(528, '5', 'dsafdsaf', '2023-11-26 12:01:22'),
(529, '5', 'dsafdsaf', '2023-11-26 12:01:22'),
(530, '5', 'dsafdsaf', '2023-11-26 12:01:22'),
(531, '5', 'dsafdsaf', '2023-11-26 12:01:22'),
(532, '5', 'dsafdsaf', '2023-11-26 12:01:22'),
(533, '5', 'dsafdsaf', '2023-11-26 12:01:22'),
(534, '5', 'dsafdsaf', '2023-11-26 12:01:22'),
(535, '5', 'dsafdsaf', '2023-11-26 12:01:22'),
(536, '5', 'dsafdsaf', '2023-11-26 12:01:22'),
(537, '5', 'dsafdsaf', '2023-11-26 12:01:22'),
(538, '5', 'dsafdsaf', '2023-11-26 12:01:23'),
(539, '5', 'dsafdsaf', '2023-11-26 12:01:23'),
(540, '5', 'dsafdsaf', '2023-11-26 12:01:23'),
(541, '5', 'fdsf', '2023-11-26 12:02:04'),
(542, '5', 'fdsaf', '2023-11-26 12:02:06'),
(543, '5', 'dsafasf', '2023-11-26 12:02:10'),
(544, '5', 'fsdaf', '2023-11-26 12:02:12'),
(545, '5', 'dsafaf', '2023-11-26 12:02:16'),
(546, '5', 'fadsf', '2023-11-26 12:02:37'),
(547, '5', 'dsfs', '2023-11-26 12:03:16'),
(548, '5', 'dsfs', '2023-11-26 12:03:17'),
(549, '5', 'dsfs', '2023-11-26 12:03:17'),
(550, '5', 'dsfs', '2023-11-26 12:03:17'),
(551, '5', 'fsadf', '2023-11-26 12:03:30'),
(552, '5', 'fdas', '2023-11-26 12:03:33'),
(553, '5', 'dsafa', '2023-11-26 12:05:03'),
(554, '5', 'dasfaf', '2023-11-26 12:05:05'),
(555, '5', 'fsadfas', '2023-11-26 12:05:07'),
(556, '5', 'fsadfa', '2023-11-26 12:05:13'),
(557, '5', 'fdsa', '2023-11-26 12:06:24'),
(558, '5', 'fdsa', '2023-11-26 12:06:24'),
(559, '5', 'fdsa', '2023-11-26 12:06:24'),
(560, '5', 'fdas', '2023-11-26 12:06:27'),
(561, '5', 'fasdf', '2023-11-26 12:06:28'),
(562, '47', 'рдиол', '2023-11-26 12:10:17'),
(563, '47', 'рдиол', '2023-11-26 12:10:17'),
(564, '47', 'аонг', '2023-11-26 12:10:21'),
(565, '47', 'опа', '2023-11-26 12:10:25'),
(566, '47', 'оапрорпо', '2023-11-26 12:10:28'),
(567, '47', 'пропо', '2023-11-26 12:10:31'),
(568, '47', 'орпо', '2023-11-26 12:10:35'),
(569, '47', 'орпорпо', '2023-11-26 12:10:37'),
(570, '47', 'орор', '2023-11-26 12:10:40'),
(571, '47', 'лдаы', '2023-11-26 12:10:57'),
(572, '47', '12345678910111213141516171819202122', '2023-11-26 12:15:50'),
(573, '47', '12345678910111213141516171819202122', '2023-11-26 12:15:51'),
(574, '1', 'asd', '2023-11-26 12:31:44'),
(575, '1', 'asd', '2023-11-26 12:32:06'),
(576, '47', 'да емае не работает. как так то', '2023-11-26 12:54:34'),
(577, '47', 'ехалгрекачерезрекувидитгрекаврекерак', '2023-11-26 12:54:59'),
(578, '47', 'аааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааа', '2023-11-26 13:01:49'),
(579, '47', 'аааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааа', '2023-11-26 13:10:58'),
(580, '47', 'аааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааа', '2023-11-26 13:12:09'),
(581, '47', 'вцццццц', '2023-11-26 13:12:24'),
(582, '1', 'asd123', '2023-11-26 13:17:51'),
(583, '1', '1231', '2023-11-26 13:18:35'),
(584, '47', 'Твой батя ***coc', '2023-11-26 13:19:15'),
(585, '47', 'сынок', '2023-11-26 13:19:17'),
(586, '6', '432', '2023-11-26 14:53:49'),
(587, '6', '9', '2023-11-26 14:53:58'),
(588, '6', '9', '2023-11-26 14:53:59'),
(589, '6', '9', '2023-11-26 14:53:59'),
(590, '6', '9', '2023-11-26 14:53:59'),
(591, '6', '9', '2023-11-26 14:54:00'),
(592, '6', '9', '2023-11-26 14:54:00'),
(593, '6', '9', '2023-11-26 14:54:00'),
(594, '47', 'АБАБАДВИМЛВТЖМУДМЗУХМОУРМОЗОСЗУОМЭУКОРСЩУЭСЖШУРКЖЩСОУКПЭУОЩКРМУМК', '2023-11-26 14:55:02'),
(595, '5', 'sdf', '2023-11-26 15:09:45'),
(596, '5', 'dafs', '2023-11-26 15:09:47'),
(597, '5', 'fds', '2023-11-26 15:14:40'),
(598, '5', 'f', '2023-11-26 15:14:42'),
(599, '5', '\'', '2023-11-26 15:15:00'),
(600, '5', 'f', '2023-11-26 15:15:00'),
(601, '5', 'dsa', '2023-11-26 15:15:03'),
(602, '5', 'd', '2023-11-26 15:15:05'),
(603, '5', 'd', '2023-11-26 15:15:08'),
(604, '5', 'd', '2023-11-26 15:15:10'),
(605, '5', 'd', '2023-11-26 15:15:12'),
(606, '5', 'd', '2023-11-26 15:15:14'),
(607, '5', 'dsf', '2023-11-26 15:15:27'),
(608, '5', 'gfd', '2023-11-26 15:16:35'),
(609, '5', '1', '2023-11-26 15:21:22'),
(610, '5', 'd', '2023-11-26 15:21:43'),
(611, '5', 'd', '2023-11-26 15:21:45'),
(612, '5', 'd', '2023-11-26 15:21:49'),
(613, '5', 'd', '2023-11-26 15:22:00'),
(614, '5', 'd', '2023-11-26 15:22:02'),
(615, '5', 'd', '2023-11-26 15:22:04'),
(616, '5', 'd', '2023-11-26 15:22:05'),
(617, '5', 'j', '2023-11-26 15:23:11'),
(618, '5', 'd', '2023-11-26 15:37:09'),
(619, '5', '2', '2023-11-26 15:47:07'),
(620, '1', '12', '2023-11-26 18:10:04'),
(621, '1', '12', '2023-11-26 18:13:59'),
(622, '6', '41234', '2023-11-26 18:27:10'),
(623, '6', '4324', '2023-11-26 18:27:12'),
(624, '1', '12', '2023-11-26 18:27:22'),
(625, '1', '12', '2023-11-26 18:28:33'),
(626, '1', '12', '2023-11-26 18:28:44'),
(627, '1', '12', '2023-11-26 18:34:13'),
(628, '1', '12', '2023-11-26 18:50:56'),
(629, '1', '12', '2023-11-26 18:55:18'),
(630, '1', '1', '2023-11-26 18:59:10'),
(631, '1', '12', '2023-11-26 18:59:54'),
(632, '1', '12', '2023-11-26 19:00:25'),
(633, '6', 'цццццццццццццццццццц', '2023-11-26 19:39:32'),
(634, '50', '63', '2023-11-27 05:28:58'),
(635, '50', '45', '2023-11-27 05:34:39'),
(636, '1', '12', '2023-11-27 07:07:45'),
(637, '1', 'g', '2023-11-27 09:34:24'),
(638, '1', 'g', '2023-11-27 09:34:25'),
(639, '54', 'GG EZZ NOOBS', '2023-11-28 07:17:41'),
(640, '54', 'RETARD', '2023-11-28 07:17:46'),
(641, '54', 'Holy Moly', '2023-11-28 07:17:55'),
(642, '54', 'Нам нужны варды.', '2023-11-28 07:19:07'),
(643, '54', 'Зевс, ультуй!', '2023-11-28 07:19:12'),
(644, '53', '12', '2023-11-28 18:36:38'),
(645, '53', '12', '2023-11-28 18:36:38'),
(646, '53', '12', '2023-11-28 18:36:38'),
(647, '53', '12', '2023-11-28 18:36:41'),
(648, '53', '24', '2023-11-28 18:42:37'),
(649, '6', '3123', '2023-11-28 19:15:25');

-- --------------------------------------------------------

--
-- Table structure for table `objects`
--

CREATE TABLE `objects` (
  `id` int(11) NOT NULL,
  `description` text CHARACTER SET utf8mb4 NOT NULL,
  `link` varchar(255) NOT NULL,
  `state` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `objects`
--

INSERT INTO `objects` (`id`, `description`, `link`, `state`) VALUES
(1, 'объект1', 'link1.png', 1),
(2, 'объект2', 'object2.png', 0);

-- --------------------------------------------------------

--
-- Table structure for table `players`
--

CREATE TABLE `players` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `x` float NOT NULL,
  `y` float NOT NULL,
  `vx` float DEFAULT NULL,
  `vy` float DEFAULT NULL,
  `dx` float NOT NULL,
  `dy` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `players`
--

INSERT INTO `players` (`id`, `user_id`, `x`, `y`, `vx`, `vy`, `dx`, `dy`) VALUES
(112974, 6, 1, 1, 1, 1, 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `skins`
--

CREATE TABLE `skins` (
  `id` int(11) NOT NULL,
  `text` text,
  `image` text,
  `role` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `skins`
--

INSERT INTO `skins` (`id`, `text`, `image`, `role`) VALUES
(1, 'Красный чупокабрик', NULL, 'lobby'),
(2, 'Синий чупокабрик', NULL, 'lobby'),
(3, 'Cупер-пупер скин аим бот', NULL, 'score'),
(4, 'Платный скин', NULL, 'paid');

-- --------------------------------------------------------

--
-- Table structure for table `teams`
--

CREATE TABLE `teams` (
  `team_id` int(11) NOT NULL,
  `team_score` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `teams`
--

INSERT INTO `teams` (`team_id`, `team_score`) VALUES
(0, 36),
(1, 10);

-- --------------------------------------------------------

--
-- Table structure for table `userObjects`
--

CREATE TABLE `userObjects` (
  `id` int(11) NOT NULL,
  `object_id` int(11) NOT NULL,
  `user_id` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `login` varchar(256) NOT NULL,
  `password` varchar(256) NOT NULL,
  `token` varchar(256) DEFAULT NULL,
  `name` text NOT NULL,
  `email` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `login`, `password`, `token`, `name`, `email`) VALUES
(1, 'Vasya', 'c082282cad5d535061e6205f6e3576a4', 'b6df9d9972c14e3d28c072641107b86d', 'Vasya', NULL),
(6, 'REFLX', '0811ba200e73ee50de034192ff94d8cb', 'ecc37afb6cd9be25cecded35e128575f', 'REFLX', 'tevermoon@gmail.com'),
(17, 'dimachka', '8ad1db449b8740a7b0173195833a362a', '848f85e55c6f5b5d65e34f83dcd3d740', 'Димон*Доминатор', 'markelovdima408@gmail.com'),
(18, 'Cashemere', '', NULL, 'Cashemere', 'galinainur1@gmail.com'),
(36, 'lapaigne', '', NULL, 'lapaigne', 'moncuere@gmail.com'),
(38, 'foget', '8869fb48dcf8fa89e24d097dc8ef9d63', NULL, 'Никита', 'fivs132@vk.com'),
(40, 'Arina_Khalyavina', '7c9b839430c9c2d809e0103daa3f2dec', NULL, 'Arina', 'arinaroy1701@gmail.com'),
(41, 'shmigger', 'd9d6df77d49047a16316b88bde46d6b9', NULL, 'smagoire', 'moncuere@gmail.com'),
(42, 'yarik', '759883b6f09495b645f176f08a987f47', NULL, 'yarik3', 'poskryar@gmail.com'),
(43, 'ruthik1', 'ae3bf193645b256533286fb68308b637', NULL, 'ruthik', 'alcinrustam@gmail.com'),
(44, 'ruthik2', '2dd632002629ecb33836c86a0a3c3833', NULL, 'ruthik', 'alcinrustam@gmail.com'),
(45, 'Arina17', '3540accfd21fba6eb19b22cea59d431d', NULL, 'Arina1717', 'arinaroy1701@gmail.com'),
(51, 'Vasya1', 'e547d3f1818ad02e658c9d32e7139e4f', NULL, 'Vasya1', 'Example@mail.ru'),
(52, 'Vasya2', '2799892b2861468b79b0d8788d561b4f', NULL, 'Vasya2', 'Example@mail.ru'),
(53, 'dargven', '470cf4c797e6f2b10ef177a6f0f39eb7', '5e30b570c71a90c38c9777a31c14bc04', 'dargven', 'dargven@yandex.ru'),
(54, 'test', '05a671c66aefea124cc08b76ea6d30bb', 'd24350387ed87e7ba580aec31d666c8b', 'test', 'test'),
(55, 'Hz', 'e895f324392847c883f8a90493286785', 'f3a399fbe808b66642197b83306fae26', 'Ravil', 'oe.ravil.00@mail.ru'),
(56, 'Pon', '770ab334874e4003442b9078cff04ec3', '6744b514dfe1b72213d3a61ce4c1a8de', 'Ravil', 'oe.ravil.00@mail.ru');

-- --------------------------------------------------------

--
-- Table structure for table `usersBullets`
--

CREATE TABLE `usersBullets` (
  `id` int(11) NOT NULL,
  `user_id` varchar(255) NOT NULL,
  `bullet_id` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `usersBullets`
--

INSERT INTO `usersBullets` (`id`, `user_id`, `bullet_id`) VALUES
(1, '5', '1'),
(2, '3', '2');

-- --------------------------------------------------------

--
-- Table structure for table `userSkins`
--

CREATE TABLE `userSkins` (
  `id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `skin_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `userSkins`
--

INSERT INTO `userSkins` (`id`, `user_id`, `skin_id`) VALUES
(1, 1, 3),
(2, 2, 1);

-- --------------------------------------------------------

--
-- Table structure for table `userTeams`
--

CREATE TABLE `userTeams` (
  `id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `team_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `userTeams`
--

INSERT INTO `userTeams` (`id`, `user_id`, `team_id`) VALUES
(46, 1, 1),
(47, 1, 1),
(48, 1, 1),
(49, 1, 1),
(50, 1, 1),
(51, 1, 2),
(52, 1, 2),
(53, 1, 2),
(54, 1, 1),
(55, 1, 999),
(56, 1, 122),
(57, 1, 99999),
(58, 1, 99999),
(59, 1, 99999),
(60, 1, 8999999);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `bullets`
--
ALTER TABLE `bullets`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `bullets_pk` (`id`),
  ADD UNIQUE KEY `bullets_pk2` (`bullet_id`);

--
-- Indexes for table `game`
--
ALTER TABLE `game`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `game_pk2` (`id`);

--
-- Indexes for table `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `objects`
--
ALTER TABLE `objects`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`);

--
-- Indexes for table `players`
--
ALTER TABLE `players`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `players_pk2` (`user_id`);

--
-- Indexes for table `skins`
--
ALTER TABLE `skins`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `teams`
--
ALTER TABLE `teams`
  ADD PRIMARY KEY (`team_id`),
  ADD UNIQUE KEY `teams_pk2` (`team_id`);

--
-- Indexes for table `userObjects`
--
ALTER TABLE `userObjects`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_pk` (`id`),
  ADD UNIQUE KEY `users_pk2` (`login`);

--
-- Indexes for table `usersBullets`
--
ALTER TABLE `usersBullets`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `usersBullets_pk2` (`id`);

--
-- Indexes for table `userSkins`
--
ALTER TABLE `userSkins`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `userTeams`
--
ALTER TABLE `userTeams`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `bullets`
--
ALTER TABLE `bullets`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT for table `messages`
--
ALTER TABLE `messages`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=650;

--
-- AUTO_INCREMENT for table `objects`
--
ALTER TABLE `objects`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `players`
--
ALTER TABLE `players`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=112978;

--
-- AUTO_INCREMENT for table `skins`
--
ALTER TABLE `skins`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `userObjects`
--
ALTER TABLE `userObjects`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=57;

--
-- AUTO_INCREMENT for table `usersBullets`
--
ALTER TABLE `usersBullets`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `userSkins`
--
ALTER TABLE `userSkins`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `userTeams`
--
ALTER TABLE `userTeams`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
